tutorials/untested/testRashV2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     reactingHetCatSimpleFoam;
application     customSolver;

startFrom       latestTime;

startTime 	    0;

stopAt          endTime;
// stopAt          writeNow;

endTime	       5100;  //endlineLine

deltaT          1;

writeControl    timeStep;

writeInterval	       5100;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;


// ************************************************************************* //

functions
{
      #include "residuals"
}
