tutorials/untested/testRashV2/system/sample
type surfaces;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

// surfaceFormat       vtk;

surfaceFormat foam;

// sets
// (
//     line_centreProfile
//     {
//         type    lineUniform;
//         axis    distance;
//         start   (10.001 -1 0.01);
//         end     (10.001 1 0.01);
//         nPoints 100;
//     }
// );

fields          ( U T ethylene prod N2);

surfaces
(
    outlet_field
    {
        type patch;
        patches (outlet);
        interpolate true;
        // Optional: whether to leave as faces (=default) or triangulate
        triangulate false;
    }
    sliceMinMax
    {
        type    plane;
        planeType pointAndNormal;
        
        pointAndNormalDict
        {
            point (0.0 0 0);
            normal (1 0 0);
        }
        
        bounds (-0.01 -0.001 -0.001) (0.01 0.001 0.001);
        zone minMaxZone;
    }
);



