tutorials/untested/testRashV2/system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name minMaxSet;
        type cellSet;
        action new;
        source cylinderToCell;
        sourceInfo
        {
            p1       (-1 0.00005 0.00015); // start point on cylinder axis
            p2       (1 0.00005 0.00015);   // end point on cylinder axis
            radius  0.01;
        }
    }
    {
        name minMaxSet;
        type cellSet;
        action delete;
        source zoneToCell;
        sourceInfo
        {
            name coatZone;      // Name of cellZone, regular expressions allowed
        }
    }
    {
        name minMaxZone;
        type cellZoneSet;
        action new;
        source setToCellZone;
        sourceInfo
        {
            set minMaxSet;           // name of cellSet
        }
    }
);

// ************************************************************************* //
